--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Solomon Relational Values\replication_package/scripts/logs/2024.02.29-15.4
> 2.21.log.txt
  log type:  text
 opened on:  29 Feb 2024, 15:42:21

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time: 29 Feb 2024 15:42:21

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Solomon Relational Values\replication_package/scripts/libraries/sta
> ta"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmataps
> s;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. * -------------------------------------------------
. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduc
> es transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. * Philipps University Marburg
. *--------------------------------------------------
. use "$working_ANALYSIS\processed\combined.dta" , clear

. 
. 
. gen outlier_wtp=0

. replace outlier_wtp= 1 if wtp>200 & country==1
(11 real changes made)

. replace outlier_wtp=1 if wtp>800 & country==2
(8 real changes made)

. bys country: tab outlier_wtp

--------------------------------------------------------------------------------------------------------------------------------------------------------
-> country = Solomon Islands

outlier_wtp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        795       98.64       98.64
          1 |         11        1.36      100.00
------------+-----------------------------------
      Total |        806      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------
-> country = Bangladesh

outlier_wtp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        294       97.35       97.35
          1 |          8        2.65      100.00
------------+-----------------------------------
      Total |        302      100.00


. 
. gen outlier_budget=0

. replace outlier_budget=1 if allocation_percent>30
(20 real changes made)

. tab outlier_budget outlier_wtp

outlier_bu |      outlier_wtp
      dget |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,069         19 |     1,088 
         1 |        20          0 |        20 
-----------+----------------------+----------
     Total |     1,089         19 |     1,108 

. 
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. *---------------------------
. *Fig. 4.        Average treatment effects
. global sociodem1 female age single i.edu hh_member hh_income_average_w wealth_pca if country==1

. global sociodem2 female age single edu_yr hh_member i.income_hh wealth_pca if country==2

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. eststo rank4: reg avg_relational i.treat $sociodem2, vce(hc3)

Linear regression                               Number of obs     =        298
                                                F(13, 284)        =       1.85
                                                Prob > F          =     0.0360
                                                R-squared         =     0.0752
                                                Root MSE          =     .61889

----------------------------------------------------------------------------------------
                       |             Robust HC3
        avg_relational |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 treat |
            Treatment  |  -.0048429   .0748522    -0.06   0.948    -.1521783    .1424925
                female |  -.2080834   .0911933    -2.28   0.023     -.387584   -.0285828
                   age |   .0058813   .0029598     1.99   0.048     .0000553    .0117072
                single |    .195625   .1710568     1.14   0.254    -.1410749    .5323249
                edu_yr |  -.0060936   .0101656    -0.60   0.549     -.026103    .0139159
             hh_member |  -.0094652   .0215953    -0.44   0.662    -.0519722    .0330419
                       |
             income_hh |
    1,000 – 3000 Taka  |   .4536418   .4500426     1.01   0.314    -.4322006    1.339484
   3,000 – 5,000 Taka  |   .2137079   .2145204     1.00   0.320    -.2085438    .6359596
  5,000 – 10,000 Taka  |   .3428335   .2010675     1.71   0.089    -.0529382    .7386052
 10,000 – 15,000 Taka  |   .4954566   .2066442     2.40   0.017      .088708    .9022052
 15,000 – 20,000 Taka  |   .4601471   .2280137     2.02   0.045     .0113358    .9089584
More than 20,000 Taka  |   .4430706   .2348935     1.89   0.060    -.0192825    .9054237
                       |
            wealth_pca |  -.1010513   .0386649    -2.61   0.009    -.1771575   -.0249452
                 _cons |   2.342286   .2794969     8.38   0.000     1.792137    2.892434
----------------------------------------------------------------------------------------

. estadd local controls "Yes"

added macro:
           e(controls) : "Yes"

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. predict treat
variable treat already defined
r(110);

end of do-file

r(110);

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. margins, dydx(treat) a
option a not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. margins, dydx(treat)

Average marginal effects                        Number of obs     =        298
Model VCE    : Robust HC3

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
  Treatment  |  -.0048429   .0748522    -0.06   0.948    -.1521783    .1424925
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. eststo budget4: reg allocation_percent_wins i.treat $sociodem2, vce(hc3)

Linear regression                               Number of obs     =        298
                                                F(13, 284)        =       1.88
                                                Prob > F          =     0.0319
                                                R-squared         =     0.0642
                                                Root MSE          =      4.577

----------------------------------------------------------------------------------------
                       |             Robust HC3
allocation_percent_w~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 treat |
            Treatment  |   .8919765   .5199135     1.72   0.087    -.1313964    1.915349
                female |  -.3342117   .6880238    -0.49   0.628    -1.688485    1.020062
                   age |   .0358812   .0213569     1.68   0.094    -.0061566     .077919
                single |   .9155058    1.70728     0.54   0.592    -2.445023    4.276035
                edu_yr |   .1730109    .087142     1.99   0.048     .0014848    .3445371
             hh_member |   .0964082   .1349682     0.71   0.476    -.1692568    .3620731
                       |
             income_hh |
    1,000 – 3000 Taka  |  -2.080309   1.331828    -1.56   0.119    -4.701816    .5411982
   3,000 – 5,000 Taka  |  -.0669362   1.590572    -0.04   0.966    -3.197741    3.063869
  5,000 – 10,000 Taka  |  -.8825593   1.193288    -0.74   0.460    -3.231371    1.466252
 10,000 – 15,000 Taka  |  -.2378538   1.401898    -0.17   0.865    -2.997282    2.521574
 15,000 – 20,000 Taka  |   1.172156    1.59551     0.73   0.463    -1.968369    4.312682
More than 20,000 Taka  |    .504283   1.759843     0.29   0.775    -2.959707    3.968273
                       |
            wealth_pca |  -.4162616   .2691233    -1.55   0.123     -.945991    .1134678
                 _cons |   3.520489   1.903179     1.85   0.065    -.2256368    7.266616
----------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. margins, dydx(treat)

Average marginal effects                        Number of obs     =        298
Model VCE    : Robust HC3

Expression   : Linear prediction, predict()
dy/dx w.r.t. : 1.treat

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |
  Treatment  |   .8919765   .5199135     1.72   0.087    -.1313964    1.915349
------------------------------------------------------------------------------
Note: dy/dx for factor levels is the discrete change from the base level.

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. margins, at(treat=(0 1))

Predictive margins                              Number of obs     =        298
Model VCE    : Robust HC3

Expression   : Linear prediction, predict()

1._at        : treat           =           0

2._at        : treat           =           1

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   5.701114   .3013015    18.92   0.000     5.108046    6.294181
          2  |    6.59309   .4250995    15.51   0.000     5.756345    7.429836
------------------------------------------------------------------------------

. 
end of do-file

. di 499-363
136

. 499-635
499 is not a valid command name
r(199);

. di 499-635
-136

. sum wtp_ppp, detail

                           wtp_ppp
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               1,108
25%     1.477105              0       Sum of Wgt.       1,108

50%     4.431314                      Mean            8.41996
                        Largest       Std. Dev.      8.906626
75%     14.77105        29.5421
90%     22.15657        29.5421       Variance       79.32799
95%      29.5421        29.5421       Skewness       1.098514
99%      29.5421        29.5421       Kurtosis       3.220694

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. tab outlier_budget outlier_wtp

outlier_bu |      outlier_wtp
      dget |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,069         19 |     1,088 
         1 |        20          0 |        20 
-----------+----------------------+----------
     Total |     1,089         19 |     1,108 

. 
end of do-file

. sum outlier_budget outlier_wtp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
outlier_bu~t |      1,108    .0180505    .1331943          0          1
 outlier_wtp |      1,108     .017148    .1298814          0          1

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. eststo budget6: reg allocation_percent_wins i.treat##i.atoll_tie $sociodem1, vce(hc3)

Linear regression                               Number of obs     =        806
                                                F(11, 794)        =       5.81
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0632
                                                Root MSE          =      8.092

-------------------------------------------------------------------------------------------------
                                |             Robust HC3
        allocation_percent_wins |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                          treat |
                     Treatment  |  -.0261279   .6740962    -0.04   0.969    -1.349349    1.297093
                                |
                      atoll_tie |
              Atoll connection  |   2.765144   .8791802     3.15   0.002     1.039352    4.490936
                                |
                treat#atoll_tie |
    Treatment#Atoll connection  |  -.0220896   1.305074    -0.02   0.986    -2.583893    2.539714
                                |
                         female |  -1.151111   .6086034    -1.89   0.059    -2.345773    .0435511
                            age |  -.1249475   .0298697    -4.18   0.000    -.1835805   -.0663145
                         single |   .2370098   .7165827     0.33   0.741    -1.169611     1.64363
                                |
                            edu |
Edu: Medium (Form 3 or Form 5)  |  -1.452584   1.027439    -1.41   0.158    -3.469401    .5642338
  Edu: High (Form 6 or Form 7)  |  -2.106515   1.091344    -1.93   0.054    -4.248777    .0357458
                                |
                      hh_member |   .1285221   .0915698     1.40   0.161    -.0512253    .3082696
            hh_income_average_w |   .0002525   .0001783     1.42   0.157    -.0000976    .0006026
                     wealth_pca |   .2774308   .1654173     1.68   0.094    -.0472762    .6021378
                          _cons |   13.97174   1.989555     7.02   0.000     10.06633    17.87715
-------------------------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD24f8_000000.tmp"

. eststo budget4: reg allocation_percent_wins i.treat $sociodem2, vce(hc3)

Linear regression                               Number of obs     =        298
                                                F(13, 284)        =       1.88
                                                Prob > F          =     0.0319
                                                R-squared         =     0.0642
                                                Root MSE          =      4.577

----------------------------------------------------------------------------------------
                       |             Robust HC3
allocation_percent_w~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 treat |
            Treatment  |   .8919765   .5199135     1.72   0.087    -.1313964    1.915349
                female |  -.3342117   .6880238    -0.49   0.628    -1.688485    1.020062
                   age |   .0358812   .0213569     1.68   0.094    -.0061566     .077919
                single |   .9155058    1.70728     0.54   0.592    -2.445023    4.276035
                edu_yr |   .1730109    .087142     1.99   0.048     .0014848    .3445371
             hh_member |   .0964082   .1349682     0.71   0.476    -.1692568    .3620731
                       |
             income_hh |
    1,000 – 3000 Taka  |  -2.080309   1.331828    -1.56   0.119    -4.701816    .5411982
   3,000 – 5,000 Taka  |  -.0669362   1.590572    -0.04   0.966    -3.197741    3.063869
  5,000 – 10,000 Taka  |  -.8825593   1.193288    -0.74   0.460    -3.231371    1.466252
 10,000 – 15,000 Taka  |  -.2378538   1.401898    -0.17   0.865    -2.997282    2.521574
 15,000 – 20,000 Taka  |   1.172156    1.59551     0.73   0.463    -1.968369    4.312682
More than 20,000 Taka  |    .504283   1.759843     0.29   0.775    -2.959707    3.968273
                       |
            wealth_pca |  -.4162616   .2691233    -1.55   0.123     -.945991    .1134678
                 _cons |   3.520489   1.903179     1.85   0.065    -.2256368    7.266616
----------------------------------------------------------------------------------------

. 
end of do-file

. exit, clear
