--------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Solomon Relational Values\replication_package/scripts/logs/2024.03.01-14.2
> 8.50.log.txt
  log type:  text
 opened on:   1 Mar 2024, 14:28:50

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  1 Mar 2024 14:28:50

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 19 Nov 2020

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    2

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Windows 64-bit

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. *   Analyses were run on Windows using Stata version 16
. version 16              // Set Version number for backward compatibility

. 
. * All required Stata packages are available in the /libraries/stata folder
. tokenize `"$S_ADO"', parse(";")

. while `"`1'"' != "" {
  2.   if `"`1'"'!="BASE" cap adopath - `"`1'"'
  3.   macro shift
  4. }

. adopath ++ "$working_ANALYSIS/scripts/libraries/stata"
  [1]              "C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Solomon Relational Values\replication_package/scripts/libraries/sta
> ta"
  [2]  (BASE)      "C:\Program Files\Stata16\ado\base/"

. mata: mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmataps
> s;lmatasem;lmatasp;lmatasvy;lmatatab;lcolrspace

. sysdir set PERSONAL "$working_ANALYSIS/scripts/libraries/stata"

. 
. * Create directories for output files
. cap mkdir "$working_ANALYSIS/processed"

. cap mkdir "$working_ANALYSIS/results"

. cap mkdir "$working_ANALYSIS/results/intermediate"

. cap mkdir "$working_ANALYSIS/results/tables"

. cap mkdir "$working_ANALYSIS/results/figures"

. * -------------------------------------------------
. 
. * Set general graph style
. set scheme swift_red //select one scheme as reference scheme to work with

. grstyle init 

. {
. *Background color
. grstyle set color white: background plotregion graphregion legend box textbox //
. 
. *Main colors (note: swift_red only defines 8 colors. Multiplying the color, that is "xx yy zz*0.5" reduces/increases intensity and "xx yy zz%50" reduc
> es transparency)
. grstyle set color       "100 143 255" "120 94 240" "220 38 127" "254 97 0" "255 176 0" /// 5 main colors
>                                         "100 143 255*0.4" "120 94 240*0.4" "220 38 127*0.4" "254 97 0*0.4" "255 176 0*0.4" ///
>                                         "100 143 255*1.7" "120 94 240*1.7" "220 38 127*1.7" "254 97 0*1.7" "255 176 0*1.7" ///
>                                         : p# p#line p#lineplot p#bar p#area p#arealine p#pie histogram 
. 
. *Font size
. grstyle set size 10pt: heading //titles
. grstyle set size 8pt: subheading axis_title //axis titles
. grstyle set size 8pt: p#label p#boxlabel body small_body text_option axis_label tick_label minortick_label key_label //all other text
. }

. * -------------------------------------------------
. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD21d8_000000.tmp"

. *--------------------------------------------------
. * 02_analysis.do
. * Authors: Max Burger & Ivo Steimanis
. * Philipps University Marburg
. *--------------------------------------------------
. use "$working_ANALYSIS\processed\combined.dta" , clear

. 
. 
. gen outlier_wtp=0

. replace outlier_wtp= 1 if wtp>200 & country==1
(11 real changes made)

. replace outlier_wtp=1 if wtp>800 & country==2
(8 real changes made)

. bys country: tab outlier_wtp

--------------------------------------------------------------------------------------------------------------------------------------------------------
-> country = Solomon Islands

outlier_wtp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        795       98.64       98.64
          1 |         11        1.36      100.00
------------+-----------------------------------
      Total |        806      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------
-> country = Bangladesh

outlier_wtp |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        294       97.35       97.35
          1 |          8        2.65      100.00
------------+-----------------------------------
      Total |        302      100.00


. 
. gen outlier_budget=0

. replace outlier_budget=1 if allocation_percent>30
(20 real changes made)

. tab outlier_budget outlier_wtp

outlier_bu |      outlier_wtp
      dget |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,069         19 |     1,088 
         1 |        20          0 |        20 
-----------+----------------------+----------
     Total |     1,089         19 |     1,108 

. 
. 
end of do-file

. bys country: sum allocation_percent_wins

--------------------------------------------------------------------------------------------------------------------------------------------------------
-> country = Solomon Islands

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
allocation~s |        806    9.940447    8.303045          1         30

--------------------------------------------------------------------------------------------------------------------------------------------------------
-> country = Bangladesh

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
allocation~s |        302    6.192053     4.59917          0         30


. do "C:\Users\istei\AppData\Local\Temp\STD21d8_000000.tmp"

. 
. mylabels 0(10)50, myscale(@) local(pctlabel) suffix("%") 
0 "0%" 10 "10%" 20 "20%" 30 "30%" 40 "40%" 50 "50%"

. twoway (hist allocation_percent_wins if country==1, bin(30) percent  color("100 143 255%40") lcolor(none) gap(10) xline(9.94, lpattern(dash) lwidth(me
> dthick))) (hist allocation_percent_wins if country==2, bin(30) percent  color("254 97 0%40") lcolor(none) gap(10) xline(6.19, lwidth(medthick) lpatter
> n(dot))), legend(order(1 "Solomon Islands" 2 "Bangladesh" )) title("{bf: D }Government budget allocation")  xtitle(in %-points) xla(0(5)30, nogrid) yl
> a(`pctlabel', nogrid) ytitle("")   xsize(4) ysize(3)  graphregion(color(none)) 
(note:  named style thin not found in class linestyle, default attributes used)

. graph save "$working_ANALYSIS\results\intermediate\figure2d", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Solomon Relational Values\replication_package\results\intermediate\figure2d.gph s
> aved)

. bys country: sum allocation_percent_wins,detail

--------------------------------------------------------------------------------------------------------------------------------------------------------
-> country = Solomon Islands

           Increase in Budget (winsorized at 30%)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%            2              1       Obs                 806
25%            4              1       Sum of Wgt.         806

50%            9                      Mean           9.940447
                        Largest       Std. Dev.      8.303045
75%           10             30
90%           25             30       Variance       68.94055
95%           30             30       Skewness       1.213937
99%           30             30       Kurtosis       3.398793

--------------------------------------------------------------------------------------------------------------------------------------------------------
-> country = Bangladesh

           Increase in Budget (winsorized at 30%)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            4              0
 5%            4              0
10%            4              2       Obs                 302
25%            4              4       Sum of Wgt.         302

50%            5                      Mean           6.192053
                        Largest       Std. Dev.       4.59917
75%            6             30
90%            9             30       Variance       21.15236
95%           12             30       Skewness       3.750991
99%           30             30       Kurtosis        18.2217


. ttest allocation_percent_wins, by(country)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 Solomon |     806    9.940447    .2924623    8.303045    9.366368    10.51453
Banglade |     302    6.192053    .2646525     4.59917     5.67125    6.712856
---------+--------------------------------------------------------------------
combined |   1,108    8.918773    .2301167    7.659811    8.467258    9.370287
---------+--------------------------------------------------------------------
    diff |            3.748394     .504592                2.758328    4.738459
------------------------------------------------------------------------------
    diff = mean(Solomon) - mean(Banglade)                         t =   7.4286
Ho: diff = 0                                     degrees of freedom =     1106

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
end of do-file

. do "C:\Users\istei\AppData\Local\Temp\STD21d8_000000.tmp"

. 
. gr combine "$working_ANALYSIS\results\intermediate\figure2a"  "$working_ANALYSIS\results\intermediate\figure2b" "$working_ANALYSIS\results\intermediat
> e\figure2c" "$working_ANALYSIS\results\intermediate\figure2d", xsize(4) ysize(3) cols(2) scale(1.1) graphregion(margin(0 0 0 0))
(note:  named style thin not found in class linestyle, default attributes used)
(note:  named style thin not found in class linestyle, default attributes used)

. graph save "$working_ANALYSIS\results\intermediate\figure3", replace
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Solomon Relational Values\replication_package\results\intermediate\figure3.gph sa
> ved)

. graph export "$working_ANALYSIS\results\figures\figure3_outcome_distributions.tif", replace width(3650)
(file C:\Users\istei\HESSENBOX\2-Projekte (Björn Vollan)\Paper SustUse\Solomon Relational Values\replication_package\results\figures\figure3_outcome_dis
> tributions.tif written in TIFF format)

. 
. 
end of do-file

. exit, clear
